"{\"abstract\":\"Finding (functional) dependencies between attributes in databases is a well-known problem with applications in knowledge discovery, feature selection, and database management. While the recently introduced reliable fraction of information measure allows to soundly quantify dependence in a way that avoids overfitting when optimizing over high-dimensional spaces, the algorithmic implications of using this score have not yet been systematically explored. This includes the computational complexity of the resulting optimization problem. \\n \\nTo this end, this paper provides the following contributions: We show that the problem of maximizing the reliable fraction of information is NP-hard, which justifies the usage of worst-case exponential-time as well as heuristic search methods that do not guarantee optimal solutions. We then greatly improve the practical performance for both of these optimization styles by deriving a novel admissible bounding function, which has an unbounded potential for additional pruning over the previously proposed one. Finally, we empirically investigate for the first time the approximation ratio of the greedy algorithm and show that in fact it produces highly competitive results in a fraction of time needed for complete branch-and-bound style search. All findings are evaluated on a wide range of real-world datasets that are publicly available along with the implementation of the algorithmic contributions. \\n \\nOur results suggest that in scenarios where no hard optimality guarantees are required, greedy optimization is a good alternative to branch-and-bound for dependency discovery. Also, the definition of the tighter bounding function is potentially more generally applicable than just to the reliable fraction of information and might be transferrable to other dependency measures.\",\"arxivId\":null,\"authors\":[{\"authorId\":\"11611372\",\"name\":\"Panagiotis Mandros\",\"url\":\"https://www.semanticscholar.org/author/11611372\"},{\"authorId\":\"1717148\",\"name\":\"M. Boley\",\"url\":\"https://www.semanticscholar.org/author/1717148\"},{\"authorId\":\"3183025\",\"name\":\"Jilles Vreeken\",\"url\":\"https://www.semanticscholar.org/author/3183025\"}],\"citationVelocity\":0,\"citations\":[{\"arxivId\":\"1809.05467\",\"authors\":[{\"authorId\":\"11611372\",\"name\":\"Panagiotis Mandros\"},{\"authorId\":\"1717148\",\"name\":\"M. Boley\"},{\"authorId\":\"3183025\",\"name\":\"Jilles Vreeken\"}],\"doi\":\"10.1109/ICDM.2018.00047\",\"intent\":[\"background\"],\"isInfluential\":false,\"paperId\":\"ed419cc675fac7747b1a7b941aee418470a4bd66\",\"title\":\"Discovering Reliable Dependencies from Data: Hardness and Improved Algorithms\",\"url\":\"https://www.semanticscholar.org/paper/ed419cc675fac7747b1a7b941aee418470a4bd66\",\"venue\":\"2018 IEEE International Conference on Data Mining (ICDM)\",\"year\":2018}],\"corpusId\":199465949,\"doi\":\"10.24963/ijcai.2019/864\",\"fieldsOfStudy\":[\"Computer Science\"],\"influentialCitationCount\":0,\"is_open_access\":true,\"is_publisher_licensed\":false,\"paperId\":\"4ab5bb9ae9477940f7435979b6aebdd0b141b7bb\",\"references\":[],\"title\":\"Discovering Reliable Dependencies from Data: Hardness and Improved Algorithms\",\"topics\":[{\"topic\":\"Algorithm\",\"topicId\":\"305\",\"url\":\"https://www.semanticscholar.org/topic/305\"}],\"url\":\"https://www.semanticscholar.org/paper/4ab5bb9ae9477940f7435979b6aebdd0b141b7bb\",\"venue\":\"IJCAI\",\"year\":2019}\n"