"{\"abstract\":\"This paper proposes a generic approach to planning in the presence of incomplete information. The approach builds on an abstract notion of a belief state representation, along with an associated set of basic operations. These operations facilitate the development of a sound and complete transition function, for reasoning about effects of actions in the presence of incomplete information, and a set of abstract algorithms for planning. The paper demonstrates how the abstract definitions and algorithms can be instantiated in three concrete representations: minimal-DNF, minimalCNF, and prime implicates, resulting in three highly competitive conformant planners: DNF, CNF, and PIP. The paper includes an experimental evaluation of the planners DNF, CNF, and PIP and proposes a new set of conformant planning benchmarks that are challenging for state-of-the-art conformant planners. 1 Motivation and Related Work Planning in the presence of incomplete information [Goldman and Boddy 1996; Smith and Weld, 1998] is the problem of generating a plan that can achieve a given goal regardless of what the actual truth value of unknown information about the initial world is. This paper focuses on conformant planning\\u2014a special class of planning problems in the presence of incomplete information\\u2014 that deals with incomplete information about the initial state and with deterministic and non-sensing actions. One of the challenges in conformant planning is the problem of reasoning about action effects in the presence of incomplete information. Specifically, consider an action a with a set of conditional effects of the form (a : \\u03c8 \\u2192 \\u03b7), where \\u03c8 and \\u03b7 are a set of literals. Each \\u2217This paper is based on the journal article [To, Son, and Pontelli, 2015]. effect (a : \\u03c8 \\u2192 \\u03b7) denotes that the set of literals \\u03b7 will be true in the resulting state after the execution of a in the current state if the e-condition \\u03c8 is true in the current state. Due to incomplete information, the current state and, hence, the truth value of \\u03c8 in it can be unknown. As a consequence, the fact that \\u03b7 must be true in the successor state can be unknown, making the computation of the successor state particularly challenging. This agrees with the results in [Baral et al., 2000; Haslum and Jonsson, 1999], that conformant planning for domains with conditional effects is at a higher complexity level than that without conditional effects. Since its introduction, conformant planning has attracted the attention of several researchers\\u2014leading to the development of several state-of-the-art conformant planners. It is important to observe that most efficient conformant planners are best-first search and progression-based planners, whose development starts with the selection of a representation language for incomplete (partially known) states and the definition of a transition (progression) function that, given a state S and an action, computes the next state S\\u2032 of the world, where S and S\\u2032 are generally incomplete and encoded in the representation. To deal with incomplete information about the world, the notion of a belief state\\u2014defined as the set of possible states\\u2014has been introduced and is widely used in planning in presence of incomplete information [Bonet and Geffner, 2000; Smith and Weld, 1998]. An advantage of this notion lies in its simplicity in representing and reasoning about the effects of actions in presence of incomplete information. Indeed, any formalism for Reasoning about Action and Change (RAC), that assumes completeness of the state, can be straightforwardly generalized to deal with incomplete states, by dealing with each individual possible state in the belief state separately, and by collecting the set of resulting states as the successor belief state. More precisely, let s be a state and a be an action executable in s (s satisfies the precondition of a). The effect of executing a in s is the set of literals that become true in the successor state, defined as e(a, s) = {` | \\u2203(a : \\u03c8 \\u2192 \\u03b7). \\u03c8 \\u2286 s \\u2227 ` \\u2208 \\u03b7} (1) Proceedings of the Twenty-Sixth International Joint Conference on Artificial Intelligence (IJCAI-17) 5076 The transition function \\u03a6(a, s) that returns the result of the execution of a in s is defined by \\u03a6(a, s) = s \\\\ e(a, s) \\u222a e(a, s) (2) where e(a, s) denotes the set of negations of literals in e(a, s). Then the function \\u03a6\\u0302(a, S) = {\\u03a6(a, s) | s \\u2208 S} characterizes the transition between belief states and can be used for reasoning with incomplete information. The downside of the direct use of belief states lies in its size, which is exponential in the number of unknown fluents. This presents two challenges for the planners employing this representation. First, it can quickly increase the memory usage for maintaining the set of generated belief states to avoid repeated search. This can often lead to the \\u2018Out of memory\\u2019 situation before the planner finds a solution. Second, it directly influences the time complexity in computing the successor belief states. To address this problem, different approaches have been proposed in state-of-the-art planners, resulting in significant improvement in their performance, both planning time and scalability on the problem size. In the planner KACMBP [Cimatti, Roveri, and Bertoli, 2004], belief states are represented as OBDDs [Bryant, 1992] with the use of model checking techniques for expanding the search space. The OBDD formula was also used in the planner POND [Bryce et al., 2006] to represent literals and actions in the planning graph for computing heuristics. This BDD-based approach does not require any extra BDD manipulation operations and it can be applied in both directions: progression and regression. However, the transition function defined for OBDDs may require a huge memory consumption in the manipulation of the OBDDs. This is a potential reason why planners employing this formulation, like POND or KACMBP, do not scale well as shown in the experimental evaluation [To, Son, and Pontelli, 2015]. Hoffmann and Brafman (2006) proposed implicit encoding of belief states with the sequence of actions that leads to the belief state from the initial state. To determine whether an unknown proposition holds in a belief state, the resulting conformant planner CFF has to reason about a CNF formula that captures the semantic of the initial belief state and the entire action sequence from it to the current belief state. This representation requires very little memory. However, it incurs excessive repeated computations and checking whether two belief states under this representation are equivalent is challenging and expensive. Furthermore, checking whether a proposition holds after the execution of even one single action in the presence of incomplete information is co-NP complete. We believe those are the main reasons why CFF has difficulties in finding a solution for even small instances of harder problems, where there are unknown propositions in the e-conditions [Palacios and Geffner, 2009; Tran et al., 2009; To, Pontelli, and Son, 2009]. The approach employed in the planners T0 [Palacios and Geffner, 2007; Palacios and Geffner, 2009] and T1 [Albore, Ramirez, and Geffner, 2011] compiles incomplete information away by translating a conformant problem into a classical problem and then using the efficient classical planner FF [Hoffmann and Nebel, 2001] to solve the resulting problem. This approach demonstrates great performance improvements, e.g., T0 and T1 can solve many hard problems of large size. However, the complete translation is exponential in the conformant width of the problem, related to the number of relevant unknown literals, and the number of literals in the resulting problem can be exponential in that of the original problem. To reduce the complexity of the translation, T0 sacrifices the completeness of the translation in certain problems. This explains why T0 is unable to return a solution in several problems, that have solutions, or the translation fails for large instances of several domains, as shown in our experiments. GC[LAMA] [Nguyen et al., 2012] is another conformant planner that uses a classical planner. This approach is based on the observation that every solution for a conformant problem is also a solution for the classical problem obtained by replacing the initial belief state with a state in it. A tentative plan \\u03b1 for such a subproblem then can be corrected, by inserting an action sequence to produce precondition for the action the plan \\u03b1 violates at that place. If \\u03b1 cannot be fixed to become a plan for the conformant problem, GC[LAMA] continues with another plan of the same or different subproblem. GC[LAMA] is efficient on problems where the action effects are monotonic, i.e., useful actions create useful literals without destroying other useful literals, and the belief state is not large. Otherwise, it is not as efficient, as reported in the experimental evaluation. Instead of using a complete transition function in the search, the planner CPA [Son et al., 2005] approximates a belief state with the intersection of the states in it [Son and Baral, 2001]. The approximation is polynomial, yet it is incomplete and so are planners employing it. Later, a complete condition for the approximation was identified and corresponding techniques were developed in CPA to make the planner complete [Son and Tu, 2006; Tu et al., 2011]. The computation of successor belief states in this approach is very simple, i.e., it can be performed in the same manner as that for belief states. However, these techniques require the system to deal with sets of approximated states, which\\u2014in the worst case\\u2014are the same as the actual belief states being represented. Hence, the approximated formula explodes in many problems, as observed in the experiments, preventing the planner to effectively scale. The authors of CPA [Tran et al., 2009] developed preprocessing techniques which help reduce the size of the initial disjunctive formula in ce\",\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\",\"url\":\"https://www.semanticscholar.org/author/34711297\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\",\"url\":\"https://www.semanticscholar.org/author/1776076\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\",\"url\":\"https://www.semanticscholar.org/author/1735551\"}],\"citationVelocity\":0,\"citations\":[],\"corpusId\":870218,\"doi\":\"10.24963/ijcai.2017/725\",\"fieldsOfStudy\":[\"Mathematics\",\"Computer Science\"],\"influentialCitationCount\":0,\"is_open_access\":true,\"is_publisher_licensed\":false,\"paperId\":\"d0acb340e519a92e4dc14085edaed9658b59d437\",\"references\":[{\"arxivId\":null,\"authors\":[{\"authorId\":\"2473054\",\"name\":\"R. Goldman\"},{\"authorId\":\"3159612\",\"name\":\"Mark S. Boddy\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"3ced821efbd312c79b9fd02b6e1af998bb384919\",\"title\":\"Expressive Planning and Explicit Knowledge\",\"url\":\"https://www.semanticscholar.org/paper/3ced821efbd312c79b9fd02b6e1af998bb384919\",\"venue\":\"AIPS\",\"year\":1996},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"S. T. To\"},{\"authorId\":null,\"name\":\"E. Pontelli\"}],\"doi\":null,\"intent\":[\"background\"],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"and T\",\"url\":\"\",\"venue\":\"C. Son,\",\"year\":2009},{\"arxivId\":\"1103.1711\",\"authors\":[{\"authorId\":\"2264691\",\"name\":\"D. Bryce\"},{\"authorId\":\"1740315\",\"name\":\"S. Kambhampati\"},{\"authorId\":\"40950572\",\"name\":\"David E. Smith\"}],\"doi\":\"10.1613/jair.1869\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"58057c9fa1f2052e4ccd405e3cad5f4f83a38bbe\",\"title\":\"Planning Graph Heuristics for Belief Space Search\",\"url\":\"https://www.semanticscholar.org/paper/58057c9fa1f2052e4ccd405e3cad5f4f83a38bbe\",\"venue\":\"J. Artif. Intell. Res.\",\"year\":2006},{\"arxivId\":null,\"authors\":[{\"authorId\":\"4746730\",\"name\":\"J. Lackie\"}],\"doi\":\"10.1016/B978-0-12-384931-1.00018-0\",\"intent\":[\"background\"],\"isInfluential\":false,\"paperId\":\"a3b8146c7950597628689d14551e74d46cc3543d\",\"title\":\"R\",\"url\":\"https://www.semanticscholar.org/paper/a3b8146c7950597628689d14551e74d46cc3543d\",\"venue\":\"The Dictionary of Cell & Molecular Biology\",\"year\":2013},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"P. Haslum\"},{\"authorId\":null,\"name\":\"P. Jonsson\"}],\"doi\":null,\"intent\":[\"result\"],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"1999\",\"url\":\"\",\"venue\":\"Some results on the complexity of planning with incomplete information. In Proc. of ECP-99, Lect. Notes in AI Vol\",\"year\":1809},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Son\"},{\"authorId\":null,\"name\":\"Tu\"},{\"authorId\":null,\"name\":\"2006 Tran C. Son\"},{\"authorId\":null,\"name\":\"Phan H. Tu\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"On the Completeness of Approximation Based Reasoning and Planning in Action Theories with Incomplete Information\",\"url\":\"\",\"venue\":\"KRR,\",\"year\":2006},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"fe8ba83c66c27d16543b85f99117a1344f7bfc8f\",\"title\":\"On the Use of Prime Implicates in Conformant Planning\",\"url\":\"https://www.semanticscholar.org/paper/fe8ba83c66c27d16543b85f99117a1344f7bfc8f\",\"venue\":\"AAAI\",\"year\":2010},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1985184\",\"name\":\"P. Haslum\"},{\"authorId\":\"7539122\",\"name\":\"P. Jonsson\"}],\"doi\":\"10.1007/10720246_24\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"67789b223fd3bcca6695d7b2152aa7bd8f3573eb\",\"title\":\"Some Results on the Complexity of Planning with Incomplete Information\",\"url\":\"https://www.semanticscholar.org/paper/67789b223fd3bcca6695d7b2152aa7bd8f3573eb\",\"venue\":\"ECP\",\"year\":1999},{\"arxivId\":\"1401.3468\",\"authors\":[{\"authorId\":\"143740864\",\"name\":\"H. Palacios\"},{\"authorId\":\"1806598\",\"name\":\"H. Geffner\"}],\"doi\":\"10.1613/jair.2708\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"a671696bd109b97de56abf3722de3187d4d2e4dd\",\"title\":\"Compiling Uncertainty Away in Conformant Planning Problems with Bounded Width\",\"url\":\"https://www.semanticscholar.org/paper/a671696bd109b97de56abf3722de3187d4d2e4dd\",\"venue\":\"J. Artif. Intell. Res.\",\"year\":2009},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"35066958\",\"name\":\"P. Tu\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"4e6898cd614c553246b91d09390aab4a16c10763\",\"title\":\"On the Completeness of Approximation Based Reasoning and Planning in Action Theories with Incomplete Information\",\"url\":\"https://www.semanticscholar.org/paper/4e6898cd614c553246b91d09390aab4a16c10763\",\"venue\":\"KR\",\"year\":2006},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"}],\"doi\":\"10.1016/j.artint.2015.06.001\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"081fd7a377b8b470857259cf23484a267587aa65\",\"title\":\"A generic approach to planning in the presence of incomplete information: Theory and implementation\",\"url\":\"https://www.semanticscholar.org/paper/081fd7a377b8b470857259cf23484a267587aa65\",\"venue\":\"Artif. Intell.\",\"year\":2015},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"T. C. Son\"},{\"authorId\":null,\"name\":\"C. Baral. Formalizing sensing actions - a transition Intelligence\"}],\"doi\":null,\"intent\":[\"methodology\"],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"125(1-2):19\\u201391\",\"url\":\"\",\"venue\":\"January\",\"year\":2001},{\"arxivId\":\"1106.0675\",\"authors\":[{\"authorId\":\"144915519\",\"name\":\"J. Hoffmann\"},{\"authorId\":\"145304209\",\"name\":\"B. Nebel\"}],\"doi\":\"10.1613/jair.855\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"7c1f7b4b57b36fcec7199d60added8cc223a7a30\",\"title\":\"The FF Planning System: Fast Plan Generation Through Heuristic Search\",\"url\":\"https://www.semanticscholar.org/paper/7c1f7b4b57b36fcec7199d60added8cc223a7a30\",\"venue\":\"J. Artif. Intell. Res.\",\"year\":2001},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1680506\",\"name\":\"R. Brafman\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"e7f81bde6d48251ae35b10df1a1be06e6a33788e\",\"title\":\"Conformant Planning via Heuristic Forward Search\",\"url\":\"https://www.semanticscholar.org/paper/e7f81bde6d48251ae35b10df1a1be06e6a33788e\",\"venue\":\"\",\"year\":2004},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"K. Nguyen\"},{\"authorId\":null,\"name\":\"V. Tran\"},{\"authorId\":null,\"name\":\"T. C. Son\"}],\"doi\":null,\"intent\":[\"background\"],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"and E\",\"url\":\"\",\"venue\":\"Pontelli,\",\"year\":2012},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"a4dd6abbcb3b0466a626178bd37969d9fd5c354e\",\"title\":\"Conjunctive Representations in Contingent Planning: Prime Implicates Versus Minimal CNF Formula\",\"url\":\"https://www.semanticscholar.org/paper/a4dd6abbcb3b0466a626178bd37969d9fd5c354e\",\"venue\":\"AAAI\",\"year\":2011},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Palacios\"},{\"authorId\":null,\"name\":\"Geffner\"},{\"authorId\":null,\"name\":\"2009 H. Palacios\"},{\"authorId\":null,\"name\":\"H. Geffner\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"Compiling Uncertainty Away\",\"url\":\"\",\"venue\":\"\",\"year\":2009},{\"arxivId\":null,\"authors\":[{\"authorId\":\"40950572\",\"name\":\"David E. Smith\"},{\"authorId\":\"1780531\",\"name\":\"Daniel S. Weld\"}],\"doi\":null,\"intent\":[\"methodology\",\"background\"],\"isInfluential\":false,\"paperId\":\"88c3f0ce160a6e33e3780a135011915c07a0373d\",\"title\":\"Conformant Graphplan\",\"url\":\"https://www.semanticscholar.org/paper/88c3f0ce160a6e33e3780a135011915c07a0373d\",\"venue\":\"AAAI/IAAI\",\"year\":1998},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"S. T. To\"},{\"authorId\":null,\"name\":\"T. C. Son\"}],\"doi\":null,\"intent\":[\"methodology\",\"result\"],\"isInfluential\":true,\"paperId\":\"\",\"title\":\"and E\",\"url\":\"\",\"venue\":\"Pontelli,\",\"year\":2015},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1694156\",\"name\":\"B. Bonet\"},{\"authorId\":\"1806598\",\"name\":\"H. Geffner\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"f4f44ad4450dede27a17992e6901f95424d399bb\",\"title\":\"Planning with Incomplete Information as Heuristic Search in Belief Space\",\"url\":\"https://www.semanticscholar.org/paper/f4f44ad4450dede27a17992e6901f95424d399bb\",\"venue\":\"AIPS\",\"year\":2000},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"35066958\",\"name\":\"P. Tu\"},{\"authorId\":\"1719720\",\"name\":\"M. Gelfond\"},{\"authorId\":\"145618143\",\"name\":\"A. R. Morales\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"24a2351256672a7732a4cea3da230eb5ad49ee2a\",\"title\":\"Conformant Planning for Domains with Constraints-A New Approach\",\"url\":\"https://www.semanticscholar.org/paper/24a2351256672a7732a4cea3da230eb5ad49ee2a\",\"venue\":\"AAAI\",\"year\":2005},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34673652\",\"name\":\"R. Bryant\"}],\"doi\":\"10.1145/136035.136043\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"45c1c49b29c8a31ae9a196cf5070824c1bbe8930\",\"title\":\"Symbolic Boolean manipulation with ordered binary-decision diagrams\",\"url\":\"https://www.semanticscholar.org/paper/45c1c49b29c8a31ae9a196cf5070824c1bbe8930\",\"venue\":\"CSUR\",\"year\":1992},{\"arxivId\":null,\"authors\":[{\"authorId\":\"2305070\",\"name\":\"Alexandre Albore\"},{\"authorId\":\"144625614\",\"name\":\"M. Ram\\u00edrez\"},{\"authorId\":\"1806598\",\"name\":\"H. Geffner\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"d7687106c386f4550066878def8df65c442ef7b5\",\"title\":\"Effective Heuristics and Belief Tracking for Planning with Incomplete Information\",\"url\":\"https://www.semanticscholar.org/paper/d7687106c386f4550066878def8df65c442ef7b5\",\"venue\":\"ICAPS\",\"year\":2011},{\"arxivId\":null,\"authors\":[{\"authorId\":\"35066958\",\"name\":\"P. Tu\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1719720\",\"name\":\"M. Gelfond\"},{\"authorId\":\"145618143\",\"name\":\"A. R. Morales\"}],\"doi\":\"10.1016/j.artint.2010.04.007\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"af287f4724e69055cabee25848bad2440a8b2dbc\",\"title\":\"Approximation of action theories and its application to conformant planning\",\"url\":\"https://www.semanticscholar.org/paper/af287f4724e69055cabee25848bad2440a8b2dbc\",\"venue\":\"Artif. Intell.\",\"year\":2011},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1742667\",\"name\":\"A. Cimatti\"},{\"authorId\":\"9138004\",\"name\":\"Marco Roveri\"},{\"authorId\":\"2943931\",\"name\":\"P. Bertoli\"}],\"doi\":\"10.1016/j.artint.2004.05.003\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"aa731e402e1bb1eb5e685d854e8eca2d5ad959b2\",\"title\":\"Conformant planning via symbolic model checking and heuristic search\",\"url\":\"https://www.semanticscholar.org/paper/aa731e402e1bb1eb5e685d854e8eca2d5ad959b2\",\"venue\":\"Artif. Intell.\",\"year\":2004},{\"arxivId\":null,\"authors\":[{\"authorId\":\"153748248\",\"name\":\"J. Hoffmann\"},{\"authorId\":\"1680506\",\"name\":\"R. Brafman\"}],\"doi\":\"10.1016/j.artint.2006.01.003\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"555656fe66a06eea17ed01f0d84e5df609667839\",\"title\":\"Conformant planning via heuristic forward search: A new approach\",\"url\":\"https://www.semanticscholar.org/paper/555656fe66a06eea17ed01f0d84e5df609667839\",\"venue\":\"Artif. Intell.\",\"year\":2006},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1760291\",\"name\":\"Chitta Baral\"}],\"doi\":\"10.1016/S0004-3702(00)00080-1\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"234c2cca8f8cf2aa23c9cf90412f7253f8b09b0b\",\"title\":\"Formalizing sensing actions A transition function based approach\",\"url\":\"https://www.semanticscholar.org/paper/234c2cca8f8cf2aa23c9cf90412f7253f8b09b0b\",\"venue\":\"Artif. Intell.\",\"year\":2001},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"897b128727e4453844ee809f057eb07fc506639e\",\"title\":\"A New Approach to Conformant Planning Using CNF*\",\"url\":\"https://www.semanticscholar.org/paper/897b128727e4453844ee809f057eb07fc506639e\",\"venue\":\"ICAPS\",\"year\":2010},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Son T. To\"},{\"authorId\":null,\"name\":\"C. Tran\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\", and Enrico Pontelli . A generic approach to planning in the presence of incomplete information : Theory and implementation\",\"url\":\"\",\"venue\":\"Proceedings of ICAPS . [ To , Son , and Pontelli , 2010 a ]\",\"year\":null},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Tran et al\"},{\"authorId\":null,\"name\":\"2009 Vien D. Tran\"},{\"authorId\":null,\"name\":\"Khoi H. Nguyen\"},{\"authorId\":null,\"name\":\"Enrico Pontelli\"},{\"authorId\":null,\"name\":\"Tran C. Son\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\"Improving performance of conformant planners: Static analysis of declarative planning domain specifications\",\"url\":\"\",\"venue\":\"In PADL,\",\"year\":2009},{\"arxivId\":null,\"authors\":[{\"authorId\":\"2781343\",\"name\":\"Hoang-Khoi Nguyen\"},{\"authorId\":\"3035873\",\"name\":\"Dang-Vien Tran\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"5622eef559747a8f8809acff9c86c00a7affb7c2\",\"title\":\"On Computing Conformant Plans Using Classical Planners: A Generate-And-Complete Approach\",\"url\":\"https://www.semanticscholar.org/paper/5622eef559747a8f8809acff9c86c00a7affb7c2\",\"venue\":\"ICAPS\",\"year\":2012},{\"arxivId\":null,\"authors\":[{\"authorId\":\"143740864\",\"name\":\"H. Palacios\"},{\"authorId\":\"1806598\",\"name\":\"H. Geffner\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"e0866d8afc23b80ad451a44aa1925399663bbee4\",\"title\":\"From Conformant into Classical Planning: Efficient Translations that May Be Complete Too\",\"url\":\"https://www.semanticscholar.org/paper/e0866d8afc23b80ad451a44aa1925399663bbee4\",\"venue\":\"ICAPS\",\"year\":2007},{\"arxivId\":null,\"authors\":[{\"authorId\":\"1760291\",\"name\":\"Chitta Baral\"},{\"authorId\":\"145735566\",\"name\":\"V. Kreinovich\"},{\"authorId\":\"143838361\",\"name\":\"R. Trejo\"}],\"doi\":\"10.1016/S0004-3702(00)00043-6\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"7054fca65f86e225c5e0cda540e23bd5b90addfe\",\"title\":\"Computational Complexity of Planning and Approximate Planning in Presence of Incompleteness\",\"url\":\"https://www.semanticscholar.org/paper/7054fca65f86e225c5e0cda540e23bd5b90addfe\",\"venue\":\"IJCAI\",\"year\":1999},{\"arxivId\":null,\"authors\":[{\"authorId\":\"34711297\",\"name\":\"Son Thanh To\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"87c0d1896079b31222551bd8603f44a9956f474b\",\"title\":\"A Conformant Planner with Explicit Disjunctive Representation of Belief States\",\"url\":\"https://www.semanticscholar.org/paper/87c0d1896079b31222551bd8603f44a9956f474b\",\"venue\":\"ICAPS\",\"year\":2009},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Son T. To\"},{\"authorId\":null,\"name\":\"Phan H. Tu\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\", Tran C . Son , and Enrico Pontelli . A generic approach to planning in the presence of incomplete information : Theory and implementation\",\"url\":\"\",\"venue\":\"\",\"year\":null},{\"arxivId\":null,\"authors\":[{\"authorId\":\"3035873\",\"name\":\"Dang-Vien Tran\"},{\"authorId\":\"2781343\",\"name\":\"Hoang-Khoi Nguyen\"},{\"authorId\":\"1735551\",\"name\":\"Enrico Pontelli\"},{\"authorId\":\"1776076\",\"name\":\"Tran Cao Son\"}],\"doi\":\"10.1007/978-3-540-92995-6_17\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"0db0420c462d94cf93516c6cc5bfb6cef14ad620\",\"title\":\"Improving Performance of Conformant Planners: Static Analysis of Declarative Planning Domain Specifications\",\"url\":\"https://www.semanticscholar.org/paper/0db0420c462d94cf93516c6cc5bfb6cef14ad620\",\"venue\":\"PADL\",\"year\":2009},{\"arxivId\":null,\"authors\":[{\"authorId\":null,\"name\":\"Enrico Pontelli Son T. To\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"\",\"title\":\", and Enrico Pontelli . A generic approach to planning in the presence of incomplete information : Theory and implementation\",\"url\":\"\",\"venue\":\"Proceedings of ICAPS . [ To , Son , and Pontelli , 2010 a ]\",\"year\":null}],\"title\":\"A generic approach to planning in the presence of incomplete information: Theory and implementation (Extended Abstract)\",\"topics\":[{\"topic\":\"Conjunctive normal form\",\"topicId\":\"274093\",\"url\":\"https://www.semanticscholar.org/topic/274093\"},{\"topic\":\"Precondition\",\"topicId\":\"1279\",\"url\":\"https://www.semanticscholar.org/topic/1279\"},{\"topic\":\"International Joint Conference on Artificial Intelligence\",\"topicId\":\"453638\",\"url\":\"https://www.semanticscholar.org/topic/453638\"},{\"topic\":\"Oracle RAC\",\"topicId\":\"1008933\",\"url\":\"https://www.semanticscholar.org/topic/1008933\"},{\"topic\":\"Color gradient\",\"topicId\":\"307413\",\"url\":\"https://www.semanticscholar.org/topic/307413\"},{\"topic\":\"pip\",\"topicId\":\"159632\",\"url\":\"https://www.semanticscholar.org/topic/159632\"},{\"topic\":\"Best-first search\",\"topicId\":\"348281\",\"url\":\"https://www.semanticscholar.org/topic/348281\"},{\"topic\":\"Executable\",\"topicId\":\"38546\",\"url\":\"https://www.semanticscholar.org/topic/38546\"},{\"topic\":\"Computation\",\"topicId\":\"339\",\"url\":\"https://www.semanticscholar.org/topic/339\"},{\"topic\":\"Algorithm\",\"topicId\":\"305\",\"url\":\"https://www.semanticscholar.org/topic/305\"},{\"topic\":\"Semantics (computer science)\",\"topicId\":\"926\",\"url\":\"https://www.semanticscholar.org/topic/926\"}],\"url\":\"https://www.semanticscholar.org/paper/d0acb340e519a92e4dc14085edaed9658b59d437\",\"venue\":\"IJCAI\",\"year\":2017}\n"