"{\"abstract\":\"Machine learning applications to electrical time series data will have wide-ranging impacts in the near future, including reducing billions of dollars of annual electrical waste. My contributions to electricity disaggregation include the first label correction approach for training samples, event detection for unsupervised disaggregation that does not require parameter tuning, and appliance discovery that makes no assumptions on appliance types. 1 The Benefits Hiding in Electrical Data Electricity disaggregation holds the promise of reducing billions of dollars of electrical waste every year. In the power grid, automatic classification of disturbance events detected by phasor measurement units could prevent cascading blackouts before they occur. Additional machine learning applications include better market segmentation by utility companies, improved design of appliances, and reliable incorporation of renewable energy resources into the power grid. My research contributions produce better accuracy, faster computation, and more scalability than previously introduced methods and can be applied to natural gas disaggregation, water disaggregation, and other source separation domains. My current work challenges long-held assumptions in time series shapelets, a classification tool with applicability in electrical time series and dozens of additional domains. 2 Electricity Disaggregation Electricity disaggregation identifies individual appliances from one or more aggregate data streams [Kolter et al., 2010]. However, to effectively reduce waste, disaggregation must be performed using inexpensive, low power hardware, making computationally expensive approaches impractical. 2.1 Label Correction for Supervised Disaggregation Supervised learning methods first train on appliance samples recorded in isolation. Afterwards these methods can then identify appliances that are operating simultaneously while being recorded by a single smart meter. However, existing approaches assume error-free labels in training data, an unrealistic assumption for data labeled by na\\u0131\\u0308ve consumers. In [Valovage and Gini, 2016], I introduced the first method to automatically correct labels in consumer-labeled training samples, enabling realistic application of supervised methods to a single house. I improved this method in [Valovage and Gini, 2017] to use a parameter-free model, making it scalable to millions of homes. While these improvements overcome limiting assumptions, supervised learning still requires hours of work by consumers to meticulously label individual appliance samples. To enable a system that requires no consumer setup, unsupervised learning is required. 2.2 Unsupervised Electricity Disaggregation It is more challenging for unsupervised learning methods to accurately identify appliances since they lack training samples and must be able to identify a wide range of appliances. Unsupervised disaggregation requires two distinct steps. First, during event detection, the aggregate power data stream is segmented into significant events that represent a state change in one or more appliances. Second, appliance discovery reconstructs appliances from these events. Existing methods for both of these steps have their own shortcomings that limit real-world deployment, detailed below. Parameter-Free Event Detection Previously introduced event detection methods depend on parameters optimized for a single appliance or dataset, limiting scalability to millions of buildings. In [Valovage and Gini, 2017], I introduced the first event detection method that does not require parameter tuning using a modified version of Bayesian change detection. Tests on 2 publicly available datasets containing 7 different houses showed Bayesian change detection performed on par with or better than existing state-of-the-art event detection methods without the need to tune parameters, making it scalable to millions of homes. Furthermore, my modifications to Bayesian change detection reduced its space and time complexity from O(n) to O(n), enabling it to run in real-time on inexpensive hardware. Model-Free Iterative Appliance Discovery Following event detection, events must be recombined into their respective appliances. Doing this with no previous assumptions is challenging since appliances can operate for different amounts of time and often overlap in operation. In addition, while simple appliances consistently generate the Proceedings of the Twenty-Seventh International Joint Conference on Artificial Intelligence (IJCAI-18)\",\"arxivId\":null,\"authors\":[{\"authorId\":\"3442752\",\"name\":\"Mark Valovage\",\"url\":\"https://www.semanticscholar.org/author/3442752\"}],\"citationVelocity\":0,\"citations\":[],\"corpusId\":51606712,\"doi\":\"10.24963/ijcai.2018/839\",\"fieldsOfStudy\":[\"Computer Science\"],\"influentialCitationCount\":0,\"is_open_access\":true,\"is_publisher_licensed\":false,\"paperId\":\"c6ad537ff6a99f92fd654272b35e5d7064adec6e\",\"references\":[{\"arxivId\":null,\"authors\":[{\"authorId\":\"3442752\",\"name\":\"Mark Valovage\"},{\"authorId\":\"50234963\",\"name\":\"Maria L. Gini\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"3f041d40c21431eaf4d175a21568209c3dcf393b\",\"title\":\"Label Correction and Event Detection for Electricity Disaggregation\",\"url\":\"https://www.semanticscholar.org/paper/3f041d40c21431eaf4d175a21568209c3dcf393b\",\"venue\":\"AAMAS\",\"year\":2017},{\"arxivId\":null,\"authors\":[{\"authorId\":\"145116464\",\"name\":\"J. Z. Kolter\"},{\"authorId\":\"33887804\",\"name\":\"S. Batra\"},{\"authorId\":\"34699434\",\"name\":\"A. Ng\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"ae73bcd83e32cb1b52b51166a477e0612a66eb52\",\"title\":\"Energy Disaggregation via Discriminative Sparse Coding\",\"url\":\"https://www.semanticscholar.org/paper/ae73bcd83e32cb1b52b51166a477e0612a66eb52\",\"venue\":\"NIPS\",\"year\":2010},{\"arxivId\":null,\"authors\":[{\"authorId\":\"2344108\",\"name\":\"O. P. Patri\"},{\"authorId\":\"2677264\",\"name\":\"Anand V. Panangadan\"},{\"authorId\":\"2465749\",\"name\":\"C. Chelmis\"},{\"authorId\":\"1728271\",\"name\":\"V. Prasanna\"}],\"doi\":\"10.1109/SUSTECH.2014.7046249\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"a48403570b6b072aef6c24f9d430ad32fb7dd4a0\",\"title\":\"Extracting discriminative features for event-based electricity disaggregation\",\"url\":\"https://www.semanticscholar.org/paper/a48403570b6b072aef6c24f9d430ad32fb7dd4a0\",\"venue\":\"2014 IEEE Conference on Technologies for Sustainability (SusTech)\",\"year\":2014},{\"arxivId\":null,\"authors\":[{\"authorId\":\"144458648\",\"name\":\"M. Biswal\"},{\"authorId\":\"2232700\",\"name\":\"Y. Hao\"},{\"authorId\":\"47978577\",\"name\":\"P. Chen\"},{\"authorId\":\"34937325\",\"name\":\"S. Brahma\"},{\"authorId\":\"1774928\",\"name\":\"H. Cao\"},{\"authorId\":\"48364527\",\"name\":\"Phillip De Leon\"}],\"doi\":\"10.1109/PSCC.2016.7540867\",\"intent\":[],\"isInfluential\":false,\"paperId\":\"bd71918a1dc177c0450b61298c53d55d707d2ff8\",\"title\":\"Signal features for classification of power system disturbances using PMU data\",\"url\":\"https://www.semanticscholar.org/paper/bd71918a1dc177c0450b61298c53d55d707d2ff8\",\"venue\":\"2016 Power Systems Computation Conference (PSCC)\",\"year\":2016},{\"arxivId\":null,\"authors\":[{\"authorId\":\"3442752\",\"name\":\"Mark Valovage\"},{\"authorId\":\"41036007\",\"name\":\"Akshay Shekhawat\"},{\"authorId\":\"50234963\",\"name\":\"Maria L. Gini\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"ac9d19f35aa9d67c68a08e9141503710ad083695\",\"title\":\"Model-Free Iterative Temporal Appliance Discovery for Unsupervised Electricity Disaggregation\",\"url\":\"https://www.semanticscholar.org/paper/ac9d19f35aa9d67c68a08e9141503710ad083695\",\"venue\":\"AAAI\",\"year\":2018},{\"arxivId\":null,\"authors\":[{\"authorId\":\"3442752\",\"name\":\"Mark Valovage\"},{\"authorId\":\"50234963\",\"name\":\"Maria L. Gini\"}],\"doi\":null,\"intent\":[],\"isInfluential\":false,\"paperId\":\"f77ce0b13ff3f77bf74165d37b223ec00b36c9bf\",\"title\":\"Automatic Label Correction and Appliance Prioritization in Single Household Electricity Disaggregation\",\"url\":\"https://www.semanticscholar.org/paper/f77ce0b13ff3f77bf74165d37b223ec00b36c9bf\",\"venue\":\"AAAI Workshop: AI for Smart Grids and Smart Buildings\",\"year\":2016}],\"title\":\"Machine Learning Approaches to Reduce Electrical Waste and Improve Power Grid Stability\",\"topics\":[{\"topic\":\"Machine learning\",\"topicId\":\"168\",\"url\":\"https://www.semanticscholar.org/topic/168\"}],\"url\":\"https://www.semanticscholar.org/paper/c6ad537ff6a99f92fd654272b35e5d7064adec6e\",\"venue\":\"IJCAI\",\"year\":2018}\n"