"{\"abstract\":\"Transfer reinforcement learning (RL) aims at improving the learning efficiency of an agent by exploiting knowledge from other source agents trained on relevant tasks. However, it remains challenging to transfer knowledge between different environmental dynamics without having access to the source environments. In this work, we explore a new challenge in transfer RL, where only a set of source policies collected under diverse unknown dynamics is available for learning a target task efficiently. To address this problem, the proposed approach, MULTI-source POLicy AggRegation (MULTIPOLAR), comprises two key techniques. We learn to aggregate the actions provided by the source policies adaptively to maximize the target task performance. Meanwhile, we learn an auxiliary network that predicts residuals around the aggregated actions, which ensures the target policy's expressiveness even when some of the source policies perform poorly. We demonstrated the effectiveness of MULTIPOLAR through an extensive experimental evaluation across six simulated environments ranging from classic control problems to challenging robotics simulations, under both continuous and discrete action spaces. The demo videos and code are available on the project webpage: https://omron-sinicx.github.io/multipolar/.\",\"arxivId\":\"1909.13111\",\"authors\":[{\"authorId\":\"39393520\",\"name\":\"M. Barekatain\",\"url\":\"https://www.semanticscholar.org/author/39393520\"},{\"authorId\":\"1899753\",\"name\":\"Ryo Yonetani\",\"url\":\"https://www.semanticscholar.org/author/1899753\"},{\"authorId\":\"33779518\",\"name\":\"Masashi Hamaya\",\"url\":\"https://www.semanticscholar.org/author/33779518\"}],\"citationVelocity\":0,\"citations\":[],\"corpusId\":220484793,\"doi\":\"10.24963/ijcai.2020/430\",\"fieldsOfStudy\":[\"Computer Science\",\"Mathematics\"],\"influentialCitationCount\":0,\"is_open_access\":false,\"is_publisher_licensed\":true,\"paperId\":\"c7316a6a2a7a958db54d358d5c96e201a1c36235\",\"references\":[],\"title\":\"MULTIPOLAR: Multi-Source Policy Aggregation for Transfer Reinforcement Learning between Diverse Environmental Dynamics\",\"topics\":[],\"url\":\"https://www.semanticscholar.org/paper/c7316a6a2a7a958db54d358d5c96e201a1c36235\",\"venue\":\"IJCAI\",\"year\":2020}\n"