"{\"abstract\":\"Multimodal analysis that uses numerical time series and textual corpora as input data sources is becoming a promising approach, especially in the financial industry. However, the main focus of such analysis has been on achieving high prediction accuracy while little effort has been spent on the important task of understanding the association between the two data modalities. Performance on the time series hence receives little explanation though human-understandable textual information is available. In this work, we address the problem of given a numerical time series, and a general corpus of textual stories collected in the same period of the time series, the task is to timely discover a succinct set of textual stories associated with that time series. Towards this goal, we propose a novel multi-modal neural model called MSIN that jointly learns both numerical time series and categorical text articles in order to unearth the association between them. Through multiple steps of data interrelation between the two data modalities, MSIN learns to focus on a small subset of text articles that best align with the performance in the time series. This succinct set is timely discovered and presented as recommended documents, acting as automated information filtering, for the given time series. We empirically evaluate the performance of our model on discovering relevant news articles for two stock time series from Apple and Google companies, along with the daily news articles collected from the Thomson Reuters over a period of seven consecutive years. The experimental results demonstrate that MSIN achieves up to 84.9% and 87.2% in recalling the ground truth articles respectively to the two examined time series, far more superior to state-of-the-art algorithms that rely on conventional attention mechanism in deep learning.\",\"arxivId\":null,\"authors\":[{\"authorId\":\"6418098\",\"name\":\"Xuan-Hong Dang\",\"url\":\"https://www.semanticscholar.org/author/6418098\"},{\"authorId\":\"144409132\",\"name\":\"S. Y. Shah\",\"url\":\"https://www.semanticscholar.org/author/144409132\"},{\"authorId\":\"1768789\",\"name\":\"P. Zerfos\",\"url\":\"https://www.semanticscholar.org/author/1768789\"}],\"citationVelocity\":0,\"citations\":[],\"corpusId\":220480904,\"doi\":\"10.24963/ijcai.2020/634\",\"fieldsOfStudy\":[\"Computer Science\"],\"influentialCitationCount\":0,\"is_open_access\":false,\"is_publisher_licensed\":false,\"paperId\":\"f7b789d48d1ef99969eb50fd3d563e8c3fd96fc5\",\"references\":[],\"title\":\"\\\"The Squawk Bot\\\": Joint Learning of Time Series and Text Data Modalities for Automated Financial Information Filtering\",\"topics\":[{\"topic\":\"Time series\",\"topicId\":\"1293\",\"url\":\"https://www.semanticscholar.org/topic/1293\"},{\"topic\":\"Information filtering system\",\"topicId\":\"77793\",\"url\":\"https://www.semanticscholar.org/topic/77793\"},{\"topic\":\"Squawk\",\"topicId\":\"663935\",\"url\":\"https://www.semanticscholar.org/topic/663935\"},{\"topic\":\"Video game bot\",\"topicId\":\"1397810\",\"url\":\"https://www.semanticscholar.org/topic/1397810\"}],\"url\":\"https://www.semanticscholar.org/paper/f7b789d48d1ef99969eb50fd3d563e8c3fd96fc5\",\"venue\":\"IJCAI\",\"year\":2020}\n"